In [7]:
pip install pandas

Requirement already satisfied: pandas in .\AppData\Local\Python\pythoncore-3.14-64\Lib\site-packages (3.0.0)
Requirement already satisfied: numpy>=2.3.3 in .\AppData\Local\Python\pythoncore-3.14-64\Lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in .\AppData\Local\Python\pythoncore-3.14-64\Lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in .\AppData\Local\Python\pythoncore-3.14-64\Lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in .\AppData\Local\Python\pythoncore-3.14-64\Lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [27]:
import pandas as pd
df = final_df.copy()

In [4]:
import sqlite3

In [9]:
orders_df = pd.read_csv("orders.csv")
final_df = orders_df.copy()
df = final_df.copy()
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [10]:
users_df=pd.read_json("users.json")
users_df.head()
users_df.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [11]:
conn = sqlite3.connect(":memory:")
with open("restaurants.sql", "r") as file:
    sql_script = file.read()
conn.executescript(sql_script)
restaurants_df = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants_df.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [12]:
print("orders exists:", "orders" in globals())
print("users exists:", "users" in globals())
print("restaurants exists:", "restaurants" in globals())

orders exists: False
users exists: False
restaurants exists: False

In [14]:
merged_df = pd.merge(
    orders_df,
    users_df,
    on="user_id",
    how="left"
)
final_df = pd.merge(
    merged_df,
    restaurants_df,
    on="restaurant_id",
    how="left"
)

In [15]:
final_df.shape
final_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           10000 non-null  int64
 1   user_id            10000 non-null  int64
 2   restaurant_id      10000 non-null  int64
 3   order_date         10000 non-null  str
 4   total_amount       10000 non-null  float64
 5   restaurant_name_x  10000 non-null  str
 6   name               10000 non-null  str
 7   city               10000 non-null  str
 8   membership         10000 non-null  str
 9   restaurant_name_y  10000 non-null  str
 10  cuisine            10000 non-null  str
 11  rating             10000 non-null  float64
dtypes: float64(2), int64(3), str(7)
memory usage: 937.6 KB

In [16]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

In [17]:
final_df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='str')

In [28]:
##MCQS
df[df["membership"] == "Gold"] \
  .groupby("city")["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [30]:
df.groupby("cuisine")["total_amount"] \
  .mean() \
  .sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [31]:
user_spend = df.groupby("user_id")["total_amount"].sum()
user_spend[user_spend > 1000].count()

np.int64(2544)

In [32]:
bins = [3.0, 3.5, 4.0, 4.5, 5.0]
labels = ["3.0–3.5", "3.6–4.0", "4.1–4.5", "4.6–5.0"]
df["rating_range"] = pd.cut(
    df["rating"],
    bins=bins,
    labels=labels,
    include_lowest=True
)
df.groupby("rating_range", observed=True)["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

rating_range
4.6–5.0    2197030.75
3.0–3.5    2136772.70
4.1–4.5    1960326.26
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

In [33]:
df[df["membership"] == "Gold"] \
  .groupby("city")["total_amount"] \
  .mean() \
  .sort_values(ascending=False)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [34]:
df.groupby("cuisine")["restaurant_id"] \
  .nunique() \
  .sort_values()
df.groupby("cuisine")["total_amount"].sum()

cuisine
Chinese    1930504.65
Indian     1971412.58
Italian    2024203.80
Mexican    2085503.09
Name: total_amount, dtype: float64

In [35]:
gold_pct = (
    df[df["membership"] == "Gold"].shape[0] / df.shape[0]
) * 100
round(gold_pct)

50

In [37]:
restaurant_stats = df.groupby("restaurant_name_x").agg(
    avg_order_value=("total_amount", "mean"),
    total_orders=("order_id", "count")
)

restaurant_stats[
    restaurant_stats["total_orders"] < 20
].sort_values("avg_order_value", ascending=False)

                                   avg_order_value  total_orders
restaurant_name_x
Hotel Dhaba Multicuisine               1040.222308            13
Sri Mess Punjabi                       1029.180833            12
Ruchi Biryani Punjabi                  1002.140625            16
Sri Delights Pure Veg                   989.467222            18
Classic Kitchen Family Restaurant       973.167895            19
...                                            ...           ...
Annapurna Tiffins Punjabi               621.828947            19
Darbar Tiffins Non-Veg                  596.815556            18
Darbar Restaurant Punjabi               589.972857            14
Spice Tiffins Pure Veg                  578.578667            15
Ruchi Mess Punjabi                      572.686471            17

[170 rows x 2 columns]

In [38]:
df.groupby(["membership", "cuisine"])["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [39]:
df["order_date"] = pd.to_datetime(df["order_date"], dayfirst=True)

df["quarter"] = df["order_date"].dt.quarter
df.groupby("quarter")["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

quarter
3    2037385.10
4    2018263.66
1    2010626.64
2    1945348.72
Name: total_amount, dtype: float64

In [40]:
##NUMERICALS
final_df[final_df["membership"] == "Gold"].shape[0]

4987

In [41]:
round(
    final_df[final_df["city"] == "Hyderabad"]["total_amount"].sum()
)

1889367

In [42]:
final_df["user_id"].nunique()

2883

In [43]:
round(
    final_df[final_df["membership"] == "Gold"]["total_amount"].mean(),
    2
)

np.float64(797.15)

In [44]:
final_df[final_df["rating"] >= 4.5].shape[0]

3374

In [45]:
gold_df = final_df[final_df["membership"] == "Gold"]
top_city = gold_df.groupby("city")["total_amount"].sum().idxmax()
gold_df[gold_df["city"] == top_city].shape[0]

1337

In [46]:
##FILL IN THE BLANKSS
print("Join column (orders ↔ users):", "user_id")

Join column (orders ↔ users): user_id

In [47]:
print("Cuisine & rating dataset format:", "SQL")

Cuisine & rating dataset format: SQL

In [48]:
df.shape[0]

10000

In [49]:
print("Missing merge values appear as:", df.isna().any().idxmax())
print("Actual missing value representation:", type(df.isna().iloc[0,0]))

Missing merge values appear as: order_id
Actual missing value representation: <class 'numpy.bool'>

In [50]:
print("Pandas function used for joins:", "merge()")

Pandas function used for joins: merge()

In [51]:
print("membership column source:", "users.json")

membership column source: users.json

In [52]:
print("Join key (orders ↔ restaurants):", "restaurant_id")

Join key (orders ↔ restaurants): restaurant_id

In [53]:
[col for col in df.columns if "cuisine" in col.lower()]

['cuisine']

In [54]:
df.groupby("user_id").size().max()

np.int64(13)